[
  {"name": "R. Sipes", "testimonial": "I recently used All Resume Services and was impressed with their professionalism and attention to detail. I had thought about creating my own job application documents, but I quickly realized I needed professional help. The experience exceeded my expectations. The team provided me with up-to-date and modern documents suitable for any job. The price was worth every cent—it's a great investment in your professional future. Communication was excellent, and they responded quickly to all my questions. I highly recommend All Resume Services to anyone looking for a professional, modern, and effective resume.", "date": "August 2025"},
  {"name": "Michael Goldenberg", "testimonial": "Thanks Sonia, I am pleased with how my professional CV & cover letter turned out.", "date": "August 2025"},
  {"name": "Jackson Misago", "testimonial": "Thank you Sonia for a wonderful Resume and cover letter. I will recommend you to my family and friends. I'm now confident applying for jobs. I can't describe your work because it's more than wonderful. I will be using All Resume Services in the future.", "date": "A Year Ago"},
  {"name": "S. Muller", "testimonial": "Oi, just gotta tell you guys some awesome news! I actually scored the job I applied for! And guess what? I owe it all to All Resume Services! Those guys really knocked it outta the park. I've used them twice now and both times they've totally outdone themselves. Their work far exceeded my expectations and I was really impressed with how they prepared me for the interviews. I felt confident and well-prepared, which definitely helped me clinch the job. Huge thanks to Sonia and her team—you guys are legends!", "date": ""},
  {"name": "T. Zboncak", "testimonial": "I am so happy with the service that I received from All Resume Services, specifically Sonia & her team. They really know how to update/write a resume that makes you stand out from the crowd. I couldn't believe how professional everything was, from the communication to the final product. Sonia asked me all the right questions to get to know my skills and experience, ensuring everything would look amazing. I have some friends that have used other resume writing companies in the past, but after seeing mine, they have serious resume envy! They wished they saved their money and gone with Sonia & her team. Who knew a resume could look so stunning? Mine is head and shoulders above the competition, and it's all thanks to All Resume Services. Highly recommend!", "date": "July 2025"},
  {"name": "Nigel Howarth", "testimonial": "In regards to the work you did on my cover letter and resume, I couldn't be happier. After years of using the same old resume and constantly adding to it, it was looking pretty ordinary. I wasn't overly keen to spend money on a new one, but I'm happy I did. The layout was nice, not overdone, the information came out good once our emailing sessions had finished, and the cover letter was very well worded. Also, the added bonus of the 22 attached documents regarding interview tips and techniques was excellent. I have, and will recommend your business to the hundreds of colleagues I have and wish you success for the future. Keep up the good work.", "date": "25/02/2015"},
  {"name": "Megan Dawson", "testimonial": "Sonia is amazing! I have been using her service for over 4 years.", "date": "10/05/2025"},
  {"name": "Mayur Chauhan", "testimonial": "Sonia's attention to detail is outstanding. She meticulously crafted each bullet point, highlighting my most relevant accomplishments and quantifying my results. She also made sure my resume was visually appealing and easy to read. I'm thrilled with the final product!", "date": "October 2024"},
  {"name": "Brad and Nichole Ralph", "testimonial": "Professional and Excellent service. Sonia assisted in defining and creating a resume & cover letter that targeted my career aspirations. It got me an interview and now I have the job. Thank you Sonia!", "date": "February 2024"},
  {"name": "Gavin Atkinson", "testimonial": "I knew I was way off the mark with my current Resume, now very pleased with the updated version from Sonia. Communication was excellent with updating details and the whole experience was very simple and taken care of professionally. Thoroughly recommend going through the process to ensure being up to date, and now there is further room to improve prospects with the additional services. Thank you so much Sonia & Team @ All Resume Services.", "date": "February 2019"},
  {"name": "Christina Paiva", "testimonial": "I've been consistently impressed with the exceptional quality of service provided by All Resume Services. Every time I've applied for a job using the resume they crafted for me, I've landed an interview. Their professionalism and swift turnaround times are unparalleled. Not only does my resume look fabulous, but it also stands out in the competitive job market here in Australia. It's worth every penny spent and I'm convinced that All Resume Services is the best in the business, and I couldn't be more satisfied with the results. Highly recommend", "date": "November 2023"},
  {"name": "Mark Randall", "testimonial": "I've had Sonia do my resume for the past seven years. Updates are constantly needed with the career I'm in. Communication has always been my main focus and the time factor in which it has been expedient. I have no hesitation in recommending All Resume Services for any seeking a professional experience.", "date": "October 2025"},
  {"name": "Ali Al Obeid", "testimonial": "I paid for the resume and cover letter service and honestly was totally surprised by the results. I want to thank Sonia for an amazing cover letter and a very professional resume. I thought I already had a good resume but after seeing her work I was really impressed.", "date": "A Year Ago"},
  {"name": "Naveen Karunaratne", "testimonial": "I reached out to Sonia and the team at All Resume Services a couple of years ago to have my resume and cover letter done upon moving to Australia. The service was extremely professional and prompt. I have had a lot of positive responses.", "date": "A year Ago"},
  {"name": "B. Emard", "testimonial": "So I was like, in the market for a new job, ya know, and I stumbled upon All Resume Services (allresumeservices.com.au) so I gave it a go! Let me tell ya, Sonia was super quick in hooking me up with a new and improved resume, cover letter and selection criteria. I didn't even realize how dated and wordy my old resume was until I got the shiny new one! The cover letter she made for me was super on point and legit, and guess what? It scored me an interview! Not only did Sonia give me some killer advice for the interview itself, but the final documentation she sent me with tips and tricks was super helpful for future interviews and job hunts. I highly recommend All Resume Services if you're looking for professional and quick turnaround. Sonia is the bomb dot com! Thanks a bunch, girl!", "date": "June 2025"},
  {"name": "C. Brekke", "testimonial": "I just have to say that All Resume Services has been a game changer for me. The new resume and cover letter they created for me have been getting me noticed by employers left and right. Before, I was applying everywhere with no success. Now, I've had 5 interviews already and been shortlisted twice! It's amazing what a difference a good resume can make. Thank you so much Sonia and team—highly recommend!", "date": ""},
  {"name": "Caroline", "testimonial": "I used your services back in 2015 having recently emigrated from Scotland. I landed two job interviews on the same day and was offered (and accepted) both casual positions. After a year as a casual, I am now full time permanent with Local Government and now have a senior position with a chance of acting up in the near future in a Co-ordinator role. I have recommended your services to friends looking to overhaul their resumes and thank you for the time and care you took 6 years ago which made a huge difference.", "date": "01/01/2015"},
  {"name": "Jaisen Tanner", "testimonial": "It was so good, it landed me my dream job in the Mining Industry!", "date": "01/10/2024"},
  {"name": "Stewart McGarth", "testimonial": "Thank you Sonia and team for the work completed on my Professional resume, Cover letter and LinkedIn profile. Highly skilled in understanding and then showcasing skills, attributes & achievements in my work experience and background, attention to detail and timeliness was very impressive. Recommend Sonia & her team, fantastic result.", "date": "June 2024"},
  {"name": "Ali Al Obeid", "testimonial": "I paid for the resume and cover letter service and honestly was total surprised by the results. I want to thank Sonia for an amazing cover letter and a very professional resume. I thought I already had good resume but after seeing her version of my resume I realised why I wasn't getting any interviews. It's been 2-3 days since I got my resume and cover letter and I've already been called up by different recruiters. I definitely recommend getting this services as it is a essential investment into your future.", "date": "March 2024"},
  {"name": "Ashley QLD", "testimonial": "Hello Sonia, Thank you very much for all of your help in answering my questions and giving me responses whenever required. I really appreciate your work done on my application. I will surely recommend your services. I have submitted my resume and cover letter today morning. I may give you more work in future. I am also looking for full time job as administration assistant / trainee accountant / graduate accountant. Whenever I will see a vacancy I will send you a link and would like you to prepare my cover letter and resume for me. Once again thank you so much for completing my cover letter and resume on time.", "date": "March 2020"},
  {"name": "Peter Koikas", "testimonial": "I was referred to Allresume Services. Great experience. Assisted me with my resume, cover letter and LinkedIn profile. Did an awesome job. Very happy with everything presented. Highly recommend Sonia and her team.", "date": "September 2025"},
  {"name": "Nrupa Shah", "testimonial": "Dear Sonia I hope this email finds you well. I wanted to take a moment to express my heartfelt gratitude for the fantastic resume and guidance you provided during my job search. I am excited to share that I have just accepted a position at SCE Group, and I couldn't have done it without your help! Your expertise in showcasing my skills and experience truly made a difference. The feedback I received from interviewers was overwhelmingly positive, and I am confident your resume played a significant role in helping me stand out. Thank you once again for your professionalism, attention to detail, and for being such a wonderful support throughout this process. I will definitely recommend your services to anyone looking for resume assistance!", "date": "July 2025"},
  {"name": "Stewart McGrath", "testimonial": "Thank you Sonia and team for the work completed on my professional resume, cover letter and LinkedIn profile. Highly skilled in understanding and then showcasing skills, attributes and strengths.", "date": "A Year Ago"},
  {"name": "Martin Hill", "testimonial": "I used your services back in 2015 having recently emigrated from Scotland. I landed two job interviews on the same day and was offered (and accepted) both casual positions. After a year as a casual, I am now full time permanent with Local Government and now have a senior position with a chance of acting up in the near future in a Co-ordinator role. I have recommended your services to friends looking to overhaul their resumes and thank you for the time and care you took 6 years ago which made a huge difference.", "date": ""},
  {"name": "Scott Green", "testimonial": "Thanks again for your services. I have received very positive feedback", "date": "01/07/2022"},
  {"name": "Tony", "testimonial": "I have used All Resume Services for the first time about 5 years ago, the service I received it was excellent! Very professional service! within one week I scored an interview and was hired in two weeks! Recently I have changed careers I needed to update my Resume and cover letter. Sonia and the team come to mind! I contacted Sonia, within no time I had a brand new resume and cover letter, it was amazing! professionally done! I have alway found Sonia and the team to be very knowledgable in their field and believe me they know their stuff, you wont be disappointed. I will continue to use All Resume Services and recommend them to family, friends any one who needs help with a great professional resume service. Thank you Sonia and the Team.", "date": "December 2023"},
  {"name": "Shyam", "testimonial": "Dear Sonia, Thank you so much for your very prompt and professional services. I would like to inform you that not only your professional expertise helped me secure an interview, the information pack that was provided also really helped me prepare for it and I have now secured the role. I would also like to acknowledge your time and input especially after hours and the fact that you showed real empathy throughout the whole process. I would not think twice before engaging your services again.", "date": "May 2020"},
  {"name": "Shirley", "testimonial": "Hi Sonia I just wanted to say thank you again for my resume. I submitted my resume on-line and within a few days I had been offered 3 interviews and then positions, so I was then able to pick my ideal career move. I have been asked by several people who helped me with the resume and have been happy to recommend your and your teams service. When I need to update it again I will know exactly where to head. Thank you again!", "date": ""},
  {"name": "Cheryl", "testimonial": "I would like to thank you so much for the service you have provided and the speed in which you were able to do for me. I have no hesitation in recommending you and your Company to others. It's not everyday you come across a company like yours that delivers on the service they've promised! Thank you again!", "date": "June 2020"},
  {"name": "Tarja", "testimonial": "Hello Sonia You have been worth every penny. You have done a fantastic job and even sent through other documentation, which I didn't expect, however will find very helpful. I will be recommending you to other friends and colleagues of mine – I will forward your contact details only to them. Thank you for everything once again.", "date": "September 2020"},
  {"name": "Karylle", "testimonial": "Hi, It's been a couple of years since my last business dealing with you. I had a successful application in the post in Emergency department from the Resume and Selection Criteria that you guys prepared for me. It's time for me to move forward again and would like to obtain your services once again and take this opportunity to thank you.", "date": "August 2020"},
  {"name": "Nina", "testimonial": "I Can't believe how quick you got that back to me. This is amazing, thank you so much, I don't think there is anything I wanna change in there thanks to you and your team for this amazing work I'll defiantly recommend you guys to all my friends and families. Have a great day. I sure will use you guys again in future.", "date": "October 2020"},
  {"name": "Jason", "testimonial": "Sorry it has taken so long to get back to you, my resume is fantastic, I've recommended you guys to a lot of my mates. Appreciate it heaps. Thankyou so much!", "date": "January 2021"},
  {"name": "Carla", "testimonial": "Hi Sonia, Just letting you know I've been having great success with the new resume. I have sent it to 20 different job applications and have had 5 interviews (so far) and have been short listed twice, so I'd say it working pretty well. I have a short list interview this Friday and have an idea for some written material, I was thinking initially to do it myself, but then thought you have been writing pretty good copies for me so far, why not get you to help me with my profiling. So thank you Sonia & your Team of writers for helping get an interview ratio of basically 1 in 4 solely on using your resume and cover letter, it's way better than what I would've done myself, especially starting out in a new industry. Hope you can help me again, Regards", "date": "December 2020"},
  {"name": "Oo Lee", "testimonial": "Hi Sonia, You probably don't remember me. But I remember you because you were the one who helped me to re-write my resume and cover letters 8 years ago when I was looking for internship programs while at uni. Back then my resume and cover letter was extremely primitive, and was extremely poorly organized that no one even cared to take a look. I even had it tailored by the university's carrier advisory service, but still it didn't attract any employer in the market. However, after I had them tailored by you, and also after few failed interviews, I managed to get multiple internship offers in year 2009 from multinational banks and IT companies. I took the internship at JP Morgan and I believe it became a great stepping stone for my carrier in the long run. Looking back now, I really feel that the quality of my resume improved by multiple times after your service, and it was a very important step forward in my carrier. I would like to thank you again for your superb service back then.", "date": "December 2020"},
  {"name": "A Hooton", "testimonial": "Hi Sonia I can't thank you enough for the prompt professional service in the overhaul of my very outdated resume, having been a self employed tradesman for the last eight years, I was very much out of the loop when it came to understanding what it took to get my skills and attributes onto a bit of paper and in the hands of a real person and possible employment. You made me understand how technical resumes actually are when we have to send off our job applications and I am so glad I chose your services as it's middle of the range pricing but it's actually priceless in the long run. After a very simple questionnaire a first draft was back within the week and I couldn't be happier with the end result, seeing my work history laid out, with all the keywords jumping off the page, gave me the confidence to apply for a job I wouldn't think I would be qualified for. I uploaded my new resume for my first job application on seek , I received a call the next day for an interview the following week, I'm currently working at ARGYLE DIAMOND MINE on a two on two off roster. Cannot thank you enough, your resumes and cover letters actually produce results and that's why I am writing to let you know. Thanks", "date": "December 2020"},
  {"name": "Warren", "testimonial": "Thank you for your help Sonia it's much appreciated and you may be pleased to know that I used your C.V to get my current job!", "date": "January 2021"},
  {"name": "Mark Jones", "testimonial": "Hi Sonia, Just wanted to let you know that as soon as I got my resume from you I updated my profile on the Roy Hill site and got an interview 2 days later. I had my medical yesterday and now have the job I wanted. Once again thank you for such a great job. I will highly recommend you to all my friends. Cheers!", "date": "January 2021"},
  {"name": "Jenni W", "testimonial": "Wow!!!! My Resume is Amazing!! Thank you so much. I am totally blown away with my resume It is far better than I ever expected thank you :)))", "date": "January 2021"},
  {"name": "Helen Dale", "testimonial": "Hi Sonia I am extremely happy with how you have used the information on hand to create a very professional \"Senior Management\" resume and cover letter. This has given me a great deal of confidence in myself and my achievements as I look to start applying for new roles. Thanks again to the All Resume Services Team!", "date": "February 2021"},
  {"name": "Luiz Gauteng", "testimonial": "Sonia, it's been a pleasure working with you! Thank you again for all your efforts. I am truly happy with the final copies. Sonia, my wife saw the drafts of my resume and cover letter and she would like to update hers as well…I will most certainly recommend you to my friends.", "date": "February 2021"},
  {"name": "Tracy Morgan", "testimonial": "Hi Sonia, Thank you very much for my Cover Letter and Resume, I am delighted with them. Also the interview information will help me so much. Your services are just the best!", "date": "February 2021"},
  {"name": "Dharani Vindya", "testimonial": "Hi Sonia, Just wanted to say a huge THANK YOU. I was asked to have a Skype interview for the job that I was looking forward to. Thanks a lot. Regards", "date": "April 2021"},
  {"name": "Phil Tanoh", "testimonial": "Hi Sonia, Thanks for resume its great, I will be having my first interview tomorrow thanks to you and your team of writers.", "date": "March 2021"},
  {"name": "Andrew Kenny", "testimonial": "Dear Sonia, Thank you so much for you're service and guidance in this field as I start my journey towards my first full time job. I truly appreciate it. Kind regards and many thanks.", "date": "March 2021"},
  {"name": "Jaisen Tanner", "testimonial": "Good afternoon Sonia, I'm just sending an quick email to say thank you so much for the amazing Resume and Cover Letter you put together for me back in May. It was so good, it landed me my dream job in the Mining Industry! Absolutely worth every penny and I couldn't recommend your services enough. Thanks again", "date": "March 2021"},
  {"name": "Megan Dawson", "testimonial": "Sonia is amazing! I have been using her service for over 4 years. I have always been blown away by how professional she is and very responsive. Thank you again Sonia.", "date": "April 2021"},
  {"name": "Dylan Barlow", "testimonial": "Sonia was very quick getting the questionnaire to me for my information and returning my completed resume and cover letter to me. I am very happy with the documents and feel more confident applying for jobs.", "date": ""},
  {"name": "Batto Batto", "testimonial": "Sonia & Team are highly experienced professionals with extensive knowledge of numerous businesses and industries. Their eye for detail is exceptional, going above and beyond your expectations to write, review and edit your resume and cover letter. I highly recommend to anyone All Résumé Services, with providing exceptional service, being clear and concise, and having a wonderful can-do attitude.", "date": "March 2021"},
  {"name": "Sandra Baxter", "testimonial": "Choosing a professional resume writer – and \"All Resume Services\" especially – is the best decision I have made towards my career. \"All Resume Services\" were extremely thorough in their consultation and made it easy for me to convey my work experience and achievements. They were very polite, professional and pleasant to talk to and I would happily use their service again in the future.", "date": "May 2021"},
  {"name": "Rachel lefebure", "testimonial": "Hi Sonia, just wanted to say thank you so much for my amazing professional RESUME. You are a lovely caring and understanding person with outstanding attention to detail. I can't thank you enough. I now feel 100% confident applying for nursing positions in Australia. Highly recommended. Best of luck for the future!!", "date": "May 2021"},
  {"name": "Andrew", "testimonial": "Dear Sonia, I would like to congratulate you and your team for the production of a very professional resume for me. Not only was a broad and complex IT skill set presented efficiently in the best possible manner but to my delight my entire interaction with All Resume Services was an exemplary display of fantastic 'old fashioned' customer service that I am more than happy to highly recommend to others. Kindest regards", "date": "May 2021"},
  {"name": "Yuji", "testimonial": "Dear Sonia Thank you so much for fast and efficient service that you guys have done for me. I'm very confident that with this resume I'm sure I can get any job I want. Thanks again. Your Sincerely", "date": "June 2021"},
  {"name": "Deb Baker", "testimonial": "Hey Sonia Thank you for your high standard of customer service Regards", "date": "June 2021"},
  {"name": "Glenn S", "testimonial": "Hi Sonia Thank you for your great work. Regards", "date": "June 2021"},
  {"name": "Jerry", "testimonial": "All Resume Services was AWESOME!!! I had been struggling to get a decent job for months then I stumbled across this service. I could not believe my eyes when I saw my new resume and cover letter. I just got the job I wanted!! Thanks, All Resume Services, Just the BEST!!!", "date": "June 2021"},
  {"name": "Nicoleta Tufis", "testimonial": "Thank you so much for your support, hope these will help me to build a new career in the future. Thanks again and I will recommend you around for doing a great job. Regards", "date": "July 2021"},
  {"name": "A Vert", "testimonial": "Thanks for your services I am very happy with the results and cant wait to start applying for jobs. Warm regards", "date": "July 2021"},
  {"name": "Anonymous (Dr. PHD)", "testimonial": "I highly recommend All Resume Services. Sonia and her team did a great job cutting my lengthy CV down and presenting it in a succinct, professional and easy to read format. I also got them to rework and tailor my cover letter for a specific job which was useful as well improve the look of my LinkedIn profile. It's a great investment into yourself.", "date": "August 2021"},
  {"name": "Caroline S", "testimonial": "I just wanted you to know that after your company did my resume and covering letter for the Mandurah Casual Ranger position I was interviewed on Monday 11th January and started in the position on Monday 18th! Thank you so much for your prompt service, I am happy to recommend your company to friends.", "date": "August 2021"},
  {"name": "Marcos", "testimonial": "Sonia and her team are very professional and has done a spectacular job. I would definitely recommend All Resume Services to everyone around the globe. Thank you!", "date": "August 2021"},
  {"name": "Belinda", "testimonial": "Good Morning Sonia, Absolutely brilliant, thank you once again!! Such a great job, and so pleased – can't thank you enough.", "date": "September 2021"},
  {"name": "E Hughes", "testimonial": "Thank you to Sonia and her team for changing my boring resume into one that really shines. I will be recommending your service to all my friends.", "date": "October 2021"},
  {"name": "Mark Belinda", "testimonial": "Hi Sonia GOT THE JOB! Can't thank you enough.", "date": "November 2021"},
  {"name": "Nigel", "testimonial": "Thank you for your help Sonia it's much appreciated and you may be pleased to know that I used your C.V to get my current job!", "date": "December 2021"},
  {"name": "Anne-Maree & Terry", "testimonial": "Thank you so much to Sonia At all Resume services my husband's cover letter and Resume have come out absolutely amazing well worth the extra for a professional Resume would recommend you in a heartbeat, many many thanks!", "date": "December 2021"},
  {"name": "Caroline Siju", "testimonial": "Hi Sonia Thank you for the excellent work on my resume, l really appreciate your professionalism in all our correspondences. I will definitely be doing more business with you in the near future. Kind Regards,", "date": "2015"},
  {"name": "P. Jamera", "testimonial": "Hi Sonia Hope you've been well, I was so happy and pleased about how you helped me set up my last CV. It really did change my job turnover and how quick they looked into my CV. It overall achieved a positive result from it and landed the job at ANZ that I wanted.", "date": ""},
  {"name": "Caroline", "testimonial": "Hi Sonia I used your services back in 2015 having recently emigrated from Scotland. I landed two job interviews on the same day and was offered (and accepted) both casual positions. After a year as a casual, I am now full time permanent with Local Government and now have a senior position with a chance of acting up in the near future in a Co-ordinator role. I have recommended your services to friends looking to overhaul their resumes and thank you for the time and care you took 6 years ago which undoubtedly help me in my career. Kind regards,", "date": "March 2022"},
  {"name": "J. Ngaheu", "testimonial": "Great work Sonia, My daughter said to thank you again, she said over a decade of resumes for our family and you never cease to amaze nor do you ever disappoint. Look forward to our final copies team. Thank you all and take care.", "date": "April 2022"},
  {"name": "S. Farrington", "testimonial": "Good afternoon, Sonia How are you? You wrote me a great resume a few years back, and got me a great job a level up from where I had been, thank you. Now I am looking at another level up with different organisation/s and would love it if you could assist me once again. Kind regards,", "date": "April 2022"},
  {"name": "Simone Emms", "testimonial": "Dear Sonia, You have created miracles with what you have put together. I am really pleased with both the resume and cover letter. Particularly, as what I have done in the past (and studied) has been so eclectic. Kind regards,", "date": "May 2022"},
  {"name": "Anna Karakyriako", "testimonial": "Hi Sonia Just letting you know just started applying for jobs and I'm getting lots of hits. Had my first interview today on Microsoft Team and looks promising. Thanks again for my resume & cover letter. Thanks", "date": "June 2022"},
  {"name": "Scott Green", "testimonial": "Thanks again for your services. I have received very positive feedback for my CV presentation so thanks for that. Kind Regards", "date": "July 2022"},
  {"name": "Jules Pitman", "testimonial": "Thanks so much once again for your time and effort in putting his life into professionalism…. I've recommended your business and will continue to do so in the future…. Many Thanks,", "date": "July 2022"},
  {"name": "Hirushi Mudalige", "testimonial": "Thank you Sonia!! I landed a job and thank you for your efforts. I have referred you to several friends and my husband and they will contact you soon. Appreciate your support in making my application a suitable one.", "date": ""},
  {"name": "Emerson Redondo", "testimonial": "Fantastic service, Prompt delivery. I have over 8 years experience in my industry 'Window Furnishings' however struggled to obtain an interview with any of the positions I applied for. After having my resume overhauled the very first position I applied for I obtained an interview and with the help of All Resume Services helping me showcase my ability on a face to face level I got the job. Highly recommend.", "date": ""},
  {"name": "Yucel", "testimonial": "Hello Sonia, I can not thank you enough for yours and your team's work in developing my resume, cover letter and LinkedIn profile. I went from 2 phone calls in 3 weeks to booking 5 interviews in 2 days of jobs applying. I now have secured myself an amazing position with a great future I would never have dreamed of before. With your materials and using your cover letter details as my basis I went to those interviews and got 5 job offers. I have been cancelling further interviews because they just keep pouring in. I have recommended your services to friends and I hope they will contact you soon. I am amazed at what a difference your presentation made.", "date": ""},
  {"name": "Kelly Parkinson", "testimonial": "All resume services again have exceeded expectations. Superfast turnaround with a fantastic review of my previous and new required documents! Will definitely use again and recomend! Thank you!", "date": ""},
  {"name": "Moesha Raklander", "testimonial": "Excellent service, well designed templates and great value for money. I would recommend this service in a hard beat. Definitely would use again.", "date": ""},
  {"name": "Harry Magoulias", "testimonial": "Great and fast job with my resume, cover letter and selection criteria!! Sonia is amazing and always eager to help!! I highly recommend all resume services!!", "date": ""},
  {"name": "Kim", "testimonial": "Excellent service all round! Fast turnaround time and emails were responded to quickly and clearly. I'm very happy with my resume and covering letter. Thank you Sonia! Highly recommend All Resume Services.", "date": ""},
  {"name": "Shima Montazemi", "testimonial": "Outstanding. Sonia and her team know what they are doing. She gets everything done in a timely manner and my resume is extremely professional and the cover letter was just as good. Thanks for everything.", "date": ""},
  {"name": "Elena Gardiman", "testimonial": "They did an amazing job of my resume. As I'm currently changing direction in my late 40's, they were able to precisely and concisely highlight my transferable skill sets and formulated it in a professional way that I never would have thought of. Thank you so much.", "date": ""},
  {"name": "Josh Holloway", "testimonial": "Excellent service and great value for money! Sonia tailored my resume to suit the mining industry and in the short time I have been using the my new professional resume to apply for potential jobs I have received numerous job opportunities and offers. I would definitely recommend All Resume Services to anyone seeking a resume upgrade and transformation.", "date": ""},
  {"name": "Pamela", "testimonial": "I highly recommend All Resume Services! Sonia is very responsive and offers an amazing service. Very impressed with my cover letter and resume!", "date": ""},
  {"name": "Brodie Neilson", "testimonial": "Exceptional service by Sonia and her team. The documents that they produced were 1st class and extra service they offer with the ATS scanning is something I had never been offered before. Highly recommend.", "date": ""},
  {"name": "Conrad D'Souza", "testimonial": "Hi Sonia, Only One Word to describe the complete transformation of my CV – Awesome!! So glad that I reached out to you for assistance. Much appreciated your professional guidance and Especially your Courteous response to my calls and emails.", "date": ""},
  {"name": "Maria Clara Ponce", "testimonial": "Sonia's service is great! I needed help to write my CV and she did it in a way to fit perfectly the vacancy that I was applying for. I recommend her services for anyone who is struggling to write their resume.", "date": ""},
  {"name": "Tracy Connolly", "testimonial": "Hi Sonia, thank you for you prompt, professional and supportive assistance in reproducing my resume after 20 years and assisting with 5 x cover letters it's has been a very positive experience. After a 8 week search my exciting news is I start my new role on Monday. Thank you again Tracy.", "date": ""},
  {"name": "Natalina Lobo", "testimonial": "Fantastic service, quick turnaround and professional. I will definitely recommend to all my friends. Did it and then guess what? I got my dream job. thanks team.", "date": ""},
  {"name": "Whitney Anders", "testimonial": "Fantastic service. Have recommended to others as very pleased with resume and cover letter. Sonia and her team are very professional and skilled.", "date": ""},
  {"name": "Andrew Kenny", "testimonial": "Fantastic service and Communications with clients. I highly recommend this business to anyone looking to update or organise their resume for the job market. Many thanks to the team.", "date": ""},
  {"name": "Sara", "testimonial": "I have used All Resume Services a number of times; they are very responsive with a quick turnaround time. On this occasion I also received a free 'Interview Preparation' pack which in my opinion, is going above and beyond their services and was a pleasant and well received extra. This is the only resume writing service I will use. Thanks to Sonia and her team.", "date": ""},
  {"name": "Marie Skewes", "testimonial": "I was very happy with Sonia help. She saved me a lot of time and stress. Fabulous and professional service. I am very happy with everything Sonia did for me. I will be recommending her services to everyone.", "date": ""},
  {"name": "Carmel Nucifora", "testimonial": "Very high quality cover letters and resumes with a customised layout for each individual job application. Very impressed with the final results and turnover times, I highly recommend Sonia and her team!", "date": ""},
  {"name": "Troy Chelo", "testimonial": "As a follow up to my previous review, I wanted to share that I recently used Sonia's resume writing services and was extremely grateful for her help. Not only was she professional and detail-oriented, but she also provided valuable insights and guidance throughout the job search process. Thanks to her expertise, I was able to secure a year 4 teaching position over 7 other candidates. I highly recommend Sonia for her excellent resume writing skills and interview strategy advice. She is a true gem and I am thankful for her assistance. Thank you Sonia for your detailed construction of my resume and your colleague support as well. The feedback from some professionals in education have looked at it, all have said that your professional input and ideas analysis is superb. The layout and attention to detail is thorough. I feel more confident moving forward with my updated resume.", "date": ""},
  {"name": "Jasmine L", "testimonial": "Excellent resume service completed in a timely manner with wonderful results. Thank you.", "date": ""},
  {"name": "Anush Karthikeyan", "testimonial": "Sonia is a professional person and also care for customer satisfaction. I went to her service because I am not able get any interview for 4 months. After her work in my resume, am getting positive response for employers. I would recommend her service to anyone.", "date": ""},
  {"name": "Guaraciara Roma Petrucci", "testimonial": "Thank you so much Sonia & Team at All Resume Services. I'm amazed how you compiled all my notes and made it into an amazing resume and cover letter, I just love your work. The process was easy and the presentation is perfect and very professional. I'm sure that I'll find my perfect job as I would hire myself!!", "date": ""},
  {"name": "Peggy Ngaheu", "testimonial": "Over a decade of resumes for our family with an amazing success rate. Thank you team for pushing through a time of crisis. I hope you are all well.", "date": ""},
  {"name": "Mono B", "testimonial": "I reached out to Sonia and her team after being recommended to them by an ex work colleague. From the beginning Sonia was thorough and prompt with her responses to my questions. After my resume was reviewed Sonia made the process of tailoring my new resume easy by having me complete an information sheet that allowed her to see my career experience to date as well where I wanted to head to next. I was amazed with the final product and could not believe the way that both my resume and cover letter were re-written. Sonia tailored my resume to be versatile for different roles and industries as I had advised her that I was wanting to change my career path. After taking a break I am now eager to commence the job hunt using my new resume. I would highly recommend Sonia and All Resume Services to anyone at any stage of life.", "date": ""},
  {"name": "Stanislav Gorin", "testimonial": "Professional service, strongly recommend.", "date": ""},
  {"name": "Ali Nazari", "testimonial": "Excellent service. Strongly recommend!", "date": ""},
  {"name": "Andrew Jackson", "testimonial": "Thanks Sonia and the All Resume Services crew for the excellent work on my recent Resume and Cover Letter upgrade, instant feedback from potential employers compared to my old document.", "date": ""},
  {"name": "Mallik Arjun", "testimonial": "I can strongly recommend All Resumes Services to anyone and everyone who are aspiring for a change in their career or even if it's the very beginning, they can help you out by preparing a person centred resume that can attract any employer. They are highly skilled and experienced in this job, I personally have experienced this and Thank the Team for their efforts and timely support, I wish them all the best!", "date": ""},
  {"name": "Naveen Karunaratne", "testimonial": "I reached out to Sonia and the team at All Resume Services a couple of years ago to have my resume and cover letter done upon moving to Australia. The service was extremely professional and prompt. I have had alot of positive responses from jobs that I have applied for since and had success in securing a fantastic role. Should and when, I require an update on my resume and cover letter, I will definitely be reaching out to the team again. Given how fantastic their service is, I have recommended Sonia to a few of my friends who have also shared alot of positive feedback on Sonia and the team at All Resume Services.", "date": "November 2023"},
  {"name": "D King", "testimonial": "Thank you immensely Sonia for your exceptional expertise in providing professional writing services. Your assistance has been invaluable, as I would have faced immense difficulty and uncertainty without it. Your prompt responsiveness, expeditious turnaround, sincere demeanour, and compassionate approach have been truly commendable and demonstrates your commitment to assisting and guiding others. I appreciate your quality of service, consistently outshining professional benchmarks. It is commendable how your pricing structure is a model of transparency and fairness, amplifying the value you provide. Thanking you!", "date": ""},
  {"name": "Gregory Kett", "testimonial": "Sonia has made one of the best resumes i have ever seen in my life she helped through a difficult time when my dad unfortunately passed away at the same time she was very understanding and was able to walk me through the process thanks so much Sonia.", "date": ""},
  {"name": "Jerry Geronimo", "testimonial": "The most impressive resume i ever had to be honest.", "date": ""}
]
