{
  "google_reviews": [
    {
      "name": "Mark Randall",
      "rating": 5,
      "timeframe": "2 months ago",
      "review": "I've had Sonia do my resume for the past seven years. Updates are constantly needed with the career im in. Communication has always been my main focus and the time factor in which has been expedient. I have no hesitation in recommending All Résumé Services for any seeking a professional experience",
      "tags": [
        "resume",
        "repeat client"
      ]
    },
    {
      "name": "Sam Magennis",
      "rating": 5,
      "timeframe": "2 months ago",
      "review": "I highly recommend all resume services.I have been using this service for some years now and I find the service to be prompt,exact,defined and custom made to suit your needs.There is even a good response from employers saying-what a well put together cv.I cannot express enough how Sonia's cv's have helped me gain employment in the past and will do in the future.A very stress free experience all round and will get you back in the workforce in no time,thank you Sonia.",
      "tags": [
        "resume",
        "repeat client"
      ]
    },
    {
      "name": "Tony Te koronga",
      "rating": 5,
      "timeframe": "2 months ago",
      "review": "very proffesional, in all aspects of resumes, would recommend without a doubt…",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Peter Koikas",
      "rating": 5,
      "timeframe": "3 months ago",
      "review": "I was refereed to Allresumes Services. Great experience. Assisted me with my resume, cover letter and LinkedIn profile. Did an awesome job. Very happy with everything presented. Highly recommend Sonia and her team.",
      "tags": [
        "linkedin",
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Winda Novitasari",
      "rating": 5,
      "timeframe": "4 months ago",
      "review": "Thanks very much Sonia and her team highly recommended their professional service",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Rasha Gallab",
      "rating": 5,
      "timeframe": "4 months ago",
      "review": "Excellent service and professional results",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Michael Goldenberg",
      "rating": 5,
      "timeframe": "5 months ago",
      "review": "Thanks Sonia, I am pleased with how my professional CV & Cover Letter turned out.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Fathima J",
      "rating": 5,
      "timeframe": "9 months ago",
      "review": "I had my resume re-profiled with Allresume services, and I couldn't be more pleased with the results. Sonia did an excellent job of highlighting my key skills, attributes, and projects, ensuring that the right keywords were included to elevate my profile. She also helped condense and summarize my lengthy career history in a way that showcased my contributions effectively, without losing the essence of my experience. Sonia was incredibly supportive and understanding throughout the entire process. She was prompt in her responses and delivered the final resume within the said timeline. Her professionalism and attention to detail made a significant difference in how my profile now reads. Highly recommend her services for anyone looking to revamp their resume.",
      "tags": [
        "resume",
        "ATS"
      ]
    },
    {
      "name": "Stewart McGrath",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Thank you Sonia and team for the work completed on my Professional resume, Cover letter and LinkedIn profile. Highly skilled in understanding and then showcasing skills, attributes & achievements in my work experience and background, attention to detail and timeliness was very impressive. Recommend Sonia & her team, fantastic result.",
      "tags": [
        "linkedin",
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Mayur Chauhan",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Sonia's attention to detail is outstanding. She meticulously crafted each bullet point, highlighting my most relevant accomplishments and quantifying my results. She also made sure my resume was visually appealing and easy to read. I'm thrilled with the final product!",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Ali Al Obeid",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "I paid for the resume and cover letter service and honestly was total surprised by the results. I want to thank Sonia for an amazing cover letter and a very professional resume. I thought I already had good resume but after seeing her version of my resume I realised why I wasn't getting any interviews. It's been 2-3 days since I got my resume and cover letter and I've already been called up by different recruiters. I definitely recommend getting this services as it is a essential investment into your future.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Jackson Misago",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Thank you Sonia for a wonderful Resume and cover letter. I will recommend you to my family and friends. I'm now confidence applying Job. I can't thank you enough. I can't describe your work because it's more than wonderful. I will be using All Résumé Services in the future.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Christina Paiva",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "I've been consistently impressed with the exceptional quality of service provided by All Résumé Services. Every time I've applied for a job using the resume they crafted for me, I've landed an interview. Their professionalism and swift turnaround times are unparalleled. Not only does my resume look fabulous, but it also stands out in the competitive job market here in Australia. It's worth every penny spent and I'm convinced that All Résumé Services is the best in the business, and I couldn't be more satisfied with the results. Highly recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Brad & Nicole Ralph",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Professional and Excellent service. Sonia assisted in defining and creating a resume & cover letter that targeted my career aspirations. It got me an interview and now I have the job. Thank you Sonia!",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Blair Bunning",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "I very happy to say I have found the experience of working with Sonia and \"All resume services\" very helpful, professional and rewarding.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "christopher kellow",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Great service. Had my resume updated. Few days later and I had my resume that couldn't have reflected my qualities, personality and work standards better if I had done it myself. Highly recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Peter Acampora",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Fast turnaround time and emails were responded to quickly, excellent service and easy to deal with. I highly recommend Sonia's services",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Mikaela Hawkins",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Sonia provided a very professional and prompt service, keeping in mind my requests. I'm very satisfied with the final outcome. 😊",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Abohala Abohala",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Great Team to work with, professional in their commitments and results",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Miao Z",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Thank you Soina!!! What a wonderful Resume !!!",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Dilina Debehapuwa",
      "rating": 5,
      "timeframe": "a year ago",
      "review": "Sonia was amazing with the resume writing and I highly recommend her to anyone who wants to get a resume writing and cover letter.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Tony",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "I have used All Résumé Services for the first time about 5 years ago, the service I received it was excellent! Very professional service! within one week I scored an interview and was hired in two weeks! Recently I have changed careers I needed to update my Resume and cover letter. Sonia and the team come to mind! I contacted Sonia, within no time I had a brand new resume and cover letter, it was amazing! professionally done! I have alway found Sonia and the team to be very knowledgable in their field and believe me they know their stuff, you wont be disappointed. I will continue to use All Résumé Services and recommend them to family, friends any one who needs help with a great professional resume service. Thank you Sonia and the Team.",
      "tags": [
        "resume",
        "cover letter",
        "repeat client",
        "career change"
      ]
    },
    {
      "name": "Troy Chelo",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "As a follow up to my previous review, I wanted to share that I recently used Sonia's resume writing services and was extremely grateful for her help. Not only was she professional and detail-oriented, but she also provided valuable insights and guidance throughout the job search process. Thanks to her expertise, I was able to secure a year 4 teaching position over 7 other candidates. I highly recommend Sonia for her excellent resume writing skills and interview strategy advice. She is a true gem and I am thankful for her assistance. Thank you Sonia for your detailed construction of my resume and your colleague support as well. The feedback from some professionals in education have looked at it i, all have said that your professional input and ideas analysis is superb. The layout and attention to detail is thorough. I feel more confident moving forward with my updated resume.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Mono B",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "I reached out to Sonia and her team after being recommended to them by an ex work colleague. From the beginning Sonia was thorough and prompt with her responses to my questions. After my resume was reviewed Sonia made the process of tailoring my new resume easy by having me complete an information sheet that allowed her to see my career experience to date as well where I wanted to head to next. I was amazed with the final product and could not believe the way that both my resume and cover letter were re-written. Sonia tailored my resume to be versatile for different roles and industries as I had advised her that I was wanting to change my career path. After taking a break I am now eager to commence the job hunt using my new resume. I would highly recommend Sonia and All Résumé Services to anyone at any stage of life.",
      "tags": [
        "resume",
        "cover letter",
        "career change"
      ]
    },
    {
      "name": "Naveen Karunaratne",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "I reached out to Sonia and the team at All Résumé Services a couple of years ago to have my resume and cover letter done upon moving to Australia. The service was extremely professional and prompt. I have had alot of positive responses from jobs that I have applied for since and had success in securing a fantastic role. Should and when, I require an update on my resume and cover letter, I will definitely be reaching out to the team again. Given how fantastic their service is, I have recommended Sonia to a few of my friends who have also shared alot of positive feedback on Sonia and the team at All Résumé Services.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "D King",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Thank you immensely Sonia for your exceptional expertise in providing professional writing services. Your assistance has been invaluable, as I would have faced immense difficulty and uncertainty without it. Your prompt responsiveness, expeditious turnaround, sincere demeanour, and compassionate approach have been truly commendable and demonstrates your commitment to assisting and guiding others. I appreciate your quality of service, consistently outshining professional benchmarks. It is commendable how your pricing structure is a model of transparency and fairness, amplifying the value you provide. Thanking you!",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Andrew Jackson - work",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Thanks Sonia and the All Résumé Services crew for the excellent work on my recent Resume and Cover Letter upgrade, instant feedback from potential employers compared to my old document",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Gregory Kett",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Sonia has made one of the best resumes i have ever seen in my life she helped through a dofficult time when my dad unfortunately passed away at the same time she was very understanding and was able to walk me trhough the process thanks so much Sonia.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Jasmine . L",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Excellent resume service completed in a timely manner with wonderful results. Thank you",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Scott mellis",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Attentive service which always delivers. Recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Jerry Geronimo",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "The most impressive resume i ever had to be honest.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Stanislav Gorin",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Professional service, strongly recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Ali Nazari",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "Professional service, strongly recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Mallik Arjun",
      "rating": 5,
      "timeframe": "2 years ago",
      "review": "I can strongly recommend All ResumesServices to anyone and everyone who are aspiring for a change in their career or even if it's the very beginning, they can help you out by preparing a person centred resume that can attract any employer. They are highly skilled and experienced in this job, I personally have experienced this and Thank the Team for their efforts and timely support, I wish them all the best!",
      "tags": [
        "resume",
        "career change"
      ]
    },
    {
      "name": "Y D",
      "rating": 5,
      "timeframe": "3 years ago",
      "review": "I can not thank the team enough for their work in developing my resume, cover letter and LinkedIn profile. I went from 2 phone calls in 3 weeks to booking 5 interviews in 2 days of jobs applying. I now have secured myself an amazing position with a great future I would never have dreamed of before. The extra materials provided allowed me to well prepare for my interviews and put me in a good mindset. I have recommended their services to friends and can not give enough praise. I am amazed at what a difference the presentation made.",
      "tags": [
        "resume",
        "cover letter",
        "linkedin"
      ]
    },
    {
      "name": "Marie Skewes",
      "rating": 5,
      "timeframe": "3 years ago",
      "review": "I was very happy with Sonia help. She saved me a lot of time and stress. Fabulous and professional service. I am very happy with everything Sonia did for me. I will be recommending her services to everyone.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Guaraciara Roma Petrucci",
      "rating": 5,
      "timeframe": "3 years ago",
      "review": "Thank you so much Sonia & Team at All Résumé Services. I'm amazed how you compiled all my notes and made it into an amazing resume and cover letter, I just love your work. The process was easy and the presentation is perfect and very professional. I'm sure that I'll find my perfect job as I would hire myself!!",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Peggy Ngaheu",
      "rating": 5,
      "timeframe": "3 years ago",
      "review": "Over a decade of resume's for our family with an amazing success rate. Thank you team for pushing through a time of crisis. I hope you are all well.",
      "tags": [
        "resume",
        "repeat client"
      ]
    },
    {
      "name": "Conrad D'Souza",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "Hi Sonia, Only One Word to describe the complete transformation of my CV - Awesome !! So glad that I reached out to you for assistance. Much appreciated your professional guidance and Especially your Courteous response to my calls and emails.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Mandy Taylor",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "I am a mature person wanting to change careers and my past experience doesn't really match the career I am applying for. Or so I thought! Somehow Sonia seemed to pull a rabbit out of the hat and make something out of almost nothing to make my experiences relevant. I love the way the resume looks so that it highlights important aspects that are easy to see straight away. I would definitely recommend All Résumé Services",
      "tags": [
        "resume",
        "career change"
      ]
    },
    {
      "name": "Anush Karthikeyan",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "Sonia is a professional person and also care for coustmer satisfaction. I went to her service because I am not able get any interview for 4 months. After her work in my resume,am getting positive response for employers. I would recommend her service to anyone.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Sara",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "I have used All Résumé Services a number of times; they are very responsive with a quick turnaround time. On this occasion I also received a free 'Interview Preparation' pack which in my opinion, is going above and beyond their services and was a pleasant and well received extra. This is the only resume writing service I will use. Thanks to Sonia and her team.",
      "tags": [
        "resume",
        "repeat client"
      ]
    },
    {
      "name": "Maria Clara Blowers-Ponce",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "Sonia's service is great! I needed help to write my CV and she did it in a way to fit perfectly the vacancy that I was applying for. I recommend her services for anyone who is struggling to write their resume.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Carmel Nucifora",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "Very high quality cover letter's and resume's with a customised layout for each individual job application. Very impressed with the final results and turnover times, I highly recommend Sonia and her team!",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Brodie Neilson",
      "rating": 5,
      "timeframe": "4 years ago",
      "review": "Exceptional service by Sonia and her team. The documents that they produced were 1st class and extra service they offer with the ATS scanning is something I had never been offered before. Highly recommend.",
      "tags": [
        "resume",
        "ATS"
      ]
    },
    {
      "name": "Josh Holloway",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Excellent service and great value for money! Sonia tailored my resume to suit the mining industry and in the short time I have been using the my new professional resume to apply for potential jobs I have received numerous job opportunities and offers. I would definitely recommend All Résumé Services to anyone seeking a resume upgrade and transformation.",
      "tags": [
        "resume",
        "mining"
      ]
    },
    {
      "name": "Kim",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Excellent service all round! Fast turnaround time and emails were responded to quickly and clearly. I'm very happy with my resume and covering letter. Thank you Sonia! Highly recommend All Résumé Services.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Emerson Redondo",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Fantastic service, Prompt delivery. I have over 8 years experience in my industry 'Window Furnishings' however struggled to obtain an interview with any of the positions I applied for. After having my resume overhauled the very first position I applied for I obtained an interview and with the help of All Résumé Services helping me showcase my ability on a face to face level I got the job. Highly recommend",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Shima Montazemi",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Outstanding. Sonia and her team know what they are doing. She gets everything done in a timely manner and my resume is extremely professional and the cover letter was just as good. Thanks for everything",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Harry Magoulias (Babis)",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Great and fast job with my resume, cover letter and selection criteria!! Sonia is amazing and always eager to help!! I highly recommend all resume services!!",
      "tags": [
        "resume",
        "cover letter",
        "selection criteria"
      ]
    },
    {
      "name": "Tracy Connolly",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Hi Sonia, thank you for you prompt, professional and supportive assistance in reproducing my resume after 20 years and assisting with 5 x cover letters it's has been a very positive experience . After a 8 week search my exciting news is I start my new role on Monday. Thank you again Tracy",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Pamela",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "I highly recommend All Résumé Services! Sonia is very responsive and offers an amazing service. Very impressed with my cover letter and resume!",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Whitney Anders",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Fantastic service. Have recommended to others as very pleased with resume and cover letter. Sonia and her team are very professional and skilled.",
      "tags": [
        "resume",
        "cover letter"
      ]
    },
    {
      "name": "Kelly Parkinson",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "All resume services again have exceeded expectations. Superfast turnaround with a fantastic review of my previous and new required documents! Will definitely use again and recomend! Thank you",
      "tags": [
        "resume",
        "repeat client"
      ]
    },
    {
      "name": "Elena Gardiman",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "They did an amazing job of my resume. As I'm currently changing direction in my late 40's, they were able to precisely and concisely highlight my transferable skill sets and formulated it in a professional way that I never would have thought of. Thank you so much",
      "tags": [
        "resume",
        "career change"
      ]
    },
    {
      "name": "Andrew Kenny",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Fantastic service and Communications with clients. I highly recommend this business to anyone looking to update or organise their resume for the job market. Many thanks to the team",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Natalina Lobo",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Fantastic service, quick turnaround and professional. I will definitely recommend to all my friends. Did it and then guess what? I got my dream job. thanks team",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Moesha Raklander",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Excellent service, well designed templates and great value for money. I would recommend this service in a hard beat. Definitely would use again.",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Steve Burke (LUKY COMMS)",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "The system works",
      "tags": [
        "resume"
      ]
    },
    {
      "name": "Terpenoid Labs",
      "rating": 5,
      "timeframe": "5 years ago",
      "review": "Professional service, highly recommended",
      "tags": [
        "resume"
      ]
    }
  ]
}